In [1]:
import pandas as pd

# Sample data
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago'],
    'Salary': [70000, 80000, 120000, 90000],
    'Date': ['2023-01-01', '2023-02-15', '2023-03-10', '2023-04-20']
}

# Create the DataFrame
df = pd.DataFrame(data)

# Display the DataFrame
print(df)

      Name  Age           City  Salary        Date
0    Alice   25       New York   70000  2023-01-01
1      Bob   30  San Francisco   80000  2023-02-15
2  Charlie   35    Los Angeles  120000  2023-03-10
3    David   40        Chicago   90000  2023-04-20

In [2]:
df[df['Salary'] > 80000]

      Name  Age         City  Salary        Date
2  Charlie   35  Los Angeles  120000  2023-03-10
3    David   40      Chicago   90000  2023-04-20